Revit 2026 API

# ViewCropRegionShapeManagerIsCropRegionShapeValid Method

---

Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCropRegionShapeValid(
	CurveLoop boundary
)
```
```vb
Public Function IsCropRegionShapeValid (
	boundary As CurveLoop
) As Boolean
```
```cpp
public:
bool IsCropRegionShapeValid(
	CurveLoop^ boundary
)
```
```fsharp
member IsCropRegionShapeValid :
        boundary : CurveLoop -> bool
```

#### Parameters

boundary CurveLoop
     The crop boundary.

#### Return Value

Boolean True if the passed crop boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Curves in boundary use model coordinates.

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace